Repository: KinGorbaZ/Topsa_Flutter_App
Catalog: lib/l10n/app_*.arb
Languages: he

source: Select Mode
he: בחר מצב

source: Single User
he: משתמש יחיד

source: Multiple Users
he: משתמשים מרובים

source: Settings
he: הגדרות

source: Language
he: שפה

source: Select Role
he: בחר תפקיד

# startAsMain
source: Start as Main Device
he: התחל כמכשיר ראשי

# startAsClient
source: Start as Client Device
he: התחל כמכשיר משני

source: Main Device
he: מכשיר ראשי

source: Client Device
he: מכשיר משני

source: Connecting...
he: מתחבר...

source: Connected
he: מחובר

# disconnected
source: Not connected
he: לא מחובר

source: Connection failed
he: החיבור נכשל

source: Connect
he: התחבר

source: Stop
he: עצור

source: Retry
he: נסה שוב

source: Discovering Clients...
he: מחפש מכשירים משניים...

# searchingForMain
source: Searching for Main Device...
he: מחפש מכשיר ראשי...

# noClientsFound
source: No client devices found
he: לא נמצאו מכשירים משניים

# waitingForMain
source: Waiting for main device...
he: ממתין למכשיר ראשי...

source: Device
he: מכשיר

# initializationFailed
source: Failed to initialize Nearby service. Please check permissions.
he: האתחול נכשל. אנא בדוק הרשאות.

source: Discovery error
he: שגיאת חיפוש

# connectionError
source: Connection error: {error}
he: שגיאת חיבור: {error}

source: Error
he: שגיאה

# gameScore
source: Score: {score}
he: ניקוד: {score}

source: Start Game
he: התחל משחק

source: Play Again
he: שחק שוב

source: Game Over!
he: !המשחק נגמר

# waitingForPlayers
source: Waiting for other players...
he: ...ממתין לשחקנים נוספים

source: Ready to start
he: מוכן להתחיל

source: Game in progress
he: משחק בתהליך

# gameTitle
source: Reaction Game
he: משחק תגובה

# tapNow
source: TAP!
he: !הקש

# waitForIt
source: WAIT...
he: ...המתן

source: Time Limit
he: הגבלת זמן

source: Score Target
he: יעד ניקוד

# timeLimitSeconds
source: Time Interval (seconds)
he: מרווח זמן (שניות)

source: Target Score
he: ניקוד יעד

source: Game Colors
he: צבעי משחק

source: (tap to remove)
he: (הקש להסרה)

source: Pick a color
he: בחר צבע

source: Game Mode
he: מצב משחק

source: Add Color
he: הוסף צבע

source: HIT!
he: !פגיעה

source: MISS!
he: !החטאה

# finalScore
source: Final Score: {value}
he: ניקוד סופי: {value}

# timeElapsed
source: Time: {value} seconds
he: זמן: {value} שניות

# quit
source: Quit Game
he: צא מהמשחק
